[
  {
    "img": "18-Cassette",
    "name": "Buddhas Besättning - Alla balla dårar",
    "tracklist": "Prologue, TV-skärm, En inre hemlighet (instrumental), !?, Indianernas sång, Tystnadens pirater, The mountains, Räddaren i nöden, Kapitalister och kommunister (instrumental), Lucifer's friend (instrumental), Forntida imperier, Epilogue",
    "equipment": "Yamaha CX5M w/ YRM-101 FM Music Composer, DX21, RX21, JVC KB600, Korg MS20",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1985",
    "unreleased": false
  },
  {
    "img": "17-Cassette",
    "name": "Buddhas Besättning - Alla ballar ur (live)",
    "tracklist": "Orientalisk böldpest (live), Lucifer's friend (live), Min dator (live)",
    "equipment": "Yamaha CX5M w/ YRM-101 FM Music Composer, DX21, RX21, JVC KB600",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1986",
    "unreleased": true
  },
  {
    "img": "16-Cassette",
    "name": "Buddhas Besättning - Alla balla dårar II",
    "tracklist": "Prologue, Tystnadens pirater, Indianernas sång, TV-skärm, En inre hemlighet (instrumental), Forntida imperier, Kapitalister och kommunister (instrumental), Hjärta av is, !?, Epilogue, Theme from the book of great sea dragons, Lyx och flärd, Tidens rand",
    "equipment": "Yamaha CX5M w/ YRM-101 FM Music Composer, DX21, RX21, R1000, Roland Alpha Juno-1, Korg MS20, KMX-8",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "July 1986",
    "unreleased": false
  },
  {
    "img": "15-Cassette",
    "name": "Buddhas Besättning - Alla balla dårar III",
    "tracklist": "Förlåt att jag kommer försent, Soundcheck, Intro, Kapitalister och kommunister, Min dator, Orientalisk böldpest, En frusen tid, Tystnadens pirater, En inre hemlighet, Spontana diafragmakontraktioner, Version, Solens tempel, Forntida imperier, Slips och gelé, Tystnadens pirater (longer mix)",
    "equipment": "Yamaha CX5M w/ YRM301 Midi Recorder, DX21, RX21, R1000, Roland Alpha Juno-1, Korg KMX-8",
    "members": "Stone, Snobben (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1986",
    "unreleased": false
  },
  {
    "img": "14-Cassette",
    "name": "Buddhas Besättning - Maskinernas Skyddsling",
    "tracklist": "Sekten / Smaragder för män, Poltergeist, The work of art, The model (instrumental), Rymdimperiet, Under hav, Trähästarna, Bond 87, Undergångsvisioner, Pocket calculator (instrumental), Jagad av maktens män",
    "equipment": "Yamaha CX5M w/ YRM301 Midi Recorder, DX21, RX21, R1000, Roland Alpha Juno-1, Korg KMX8, MS20",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1986",
    "unreleased": false
  },
  {
    "img": "13-Cassette",
    "name": "Buddhas Besättning - Maskinernas Skyddsling II",
    "tracklist": "Den vilda vindens öar, Trogna män och rika kungar, Contorting, Under hav (1987), Moder jord, Gudarnas marknad, Den vilda vindens öar (mix 2), Framtidsdrömmarna",
    "equipment": "Yamaha CX5M w/ YRM301 Midi Recorder, DX21, Roland Alpha Juno-1, Juno-106, TR-505, Korg KMX8",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1987",
    "unreleased": false
  },
  {
    "img": "12-Cassette",
    "name": "Buddhas Besättning - S.D.T.",
    "tracklist": "Class of '87, Fun K, Secrets / Contact, Steel machine eyes, Lunch time, Laurel canyon",
    "equipment": "Yamaha CX5M w/ YRM301 Midi Recorder, DX21, RX21, Roland Alpha Juno-1, S-10, Korg KMX8, Sqoe Ranger guitars",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1987",
    "unreleased": true
  },
  {
    "img": "11-Cassette",
    "name": "Buddhas Besättning - Unket",
    "tracklist": "Dansa (instrumental), Tide breaker, Down down down, Sökaren, Player one, Take no 5, This is the story, Prime time pressure, People, Un caet, Contact",
    "equipment": "Yamaha QX21, DX21, RX21, Roland Alpha Juno-1, Korg KMX8, Unknown reverb",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1987",
    "unreleased": true
  },
  {
    "img": "10-Cassette",
    "name": "Buddhas Besättning - Pest",
    "tracklist": "Born blind, Slaughter house, In the name of Jesus, Heaven and hell, Waiting 4 the morgue, Plastic surgery, C.U.C.S.C.A.P., Tear my soul apart, Aqua",
    "equipment": "Yamaha QX21, DX21, RX21, Roland Alpha Juno-1, TR-727, Korg KMX8, Akai X-7000",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1987",
    "unreleased": false
  },
  {
    "img": "09-Cassette",
    "name": "Lesbian Disguise of a Female Body - Live",
    "tracklist": "Prologue (Levictus is dying) (live), Erleben nicht aus (live), Laagrikeee 4. (live), Crime time (live), Left legged (live), The gore factory (live), Lindey's got a brand new dog (kill it!) (live), Smell at it (live), Epilogue (what a shame) (live)",
    "equipment": "Yamaha QX21, DX2, Pearl Syncussion SY-1, Korg MS20, KMX8, Boss DR-220E, Roland Alpha Juno-1, TR-727, Akai X-7000, Ibanez Guitars",
    "members": "W, Ö, A, T (Joacim Thenander, Jonas Österdahl, Henrik Araviadis, Mattias Axén)",
    "recorded": "February 19, 1988",
    "unreleased": false
  },
  {
    "img": "08-Cassette",
    "name": "Die Die Mauer Bau - Die Die Mauer Bau",
    "tracklist": "Naiive, Unconstitutional, Gretchen, Brain diggers, Pain, Burn, Corruption, Assassin, Conf_sion, Dr Penetration, Horst, Epilogue, Min dator",
    "equipment": "Yamaha QX21, DX21, RX21, Roland Alpha Juno-1, Korg KMX8, Akai S-700",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1988",
    "unreleased": false
  },
  {
    "img": "07-Cassette",
    "name": "Slam Jam Dynamite - Dead Aim & Attack",
    "tracklist": "This is the beat, Come on y'all (get funky), Walking on acid, Personal, Acid girl (turn me on), Down and funky, Mr Rubber, Can you feel it, Gotta get, Lolita, Stretch machine (just plain funk)",
    "equipment": "Yamaha QX21, DX21, Roland Alpha Juno-1, TR-727, Korg KMX8, Akai S-700",
    "members": "Mr Kornfield, Terminator Sam (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1989",
    "unreleased": false
  },
  {
    "img": "06-Cassette",
    "name": "The Female Body - The Female Body",
    "tracklist": "Mania (Ecvation), Mania (The man with the million dollar smile), Laagrikeee 7., Fascisma, Crotch, Burning needles, Counting the corpse (instrumental), Lindey's got a brand new dog (kill it!), Hysteria",
    "equipment": "Yamaha QX21, DX21, Crumar BIT Midi Master Keyboard, Korg KMX8, Roland S-330, D-110",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1989",
    "unreleased": false
  },
  {
    "img": "05-Cassette",
    "name": "The Female Body - Live",
    "tracklist": "Mania (Ecvation) (live), Mania (The man with the million dollar smile) (live), Laagrikeee 7. (live), Fascisma (live), Crotch (live), Burning needles (live), Counting the corpse (live), Lindey's got a brand new dog (kill it!) (live), Hysteria (live)",
    "equipment": "Yamaha QX21, DX21, Crumar BIT Midi Master Keyboard, Korg KMX8, Roland S-330, D-110, Gibson and Ibanez guitars, Electone radio/tape recorder",
    "members": "Wallin, Ö-dahl, A, G-son (Joacim Thenander, Jonas Österdahl, Henrik Araviadis, Örjan Gudmundsson)",
    "recorded": "September 26, 1989",
    "unreleased": false
  },
  {
    "img": "19-Cassette",
    "name": "Slam Jam Dynamite - Time",
    "tracklist": "Fresh, Miss Sugar, Star time, I can't, Don't stop (loving me), Keep the frequency clear, Here we go, Sometimes, One hand in the air, C'est Louie, Who's buying the record, School rap, Pussy talk, Knight of the computer age, Walk, The world, Beat, Seven, Don't stop (loving me)",
    "equipment": "Yamaha QX21, DX21, TX81Z, Roland S-330, D-110, PC-200, Alpha Juno-1, TR-727, Crumar BIT Midi Master Keyboard, Korg KMX8, Akai S-700, X-7000, Atari 1040STFM, Steinberg Cubase 1.0, Korg KMX8, Sequential Circuits TOM",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1988-1989",
    "unreleased": true
  },
  {
    "img": "04-Cassette",
    "name": "Buddhas Besättning - The maniac puppet performance (backtracks)",
    "tracklist": "Agony and fake reactions (instrumental), The test (instrumental), Corruption (instrumental), Body-Mechanic (instrumental), Henry Spencer and the garden of evil (instrumental), Prohibited (instrumental), Erleben nicht aus (instrumental)",
    "equipment": "Atari 1040STFM, Steinberg Cubase 1.0, Yamaha TX81Z, Korg KMX8, Roland S-330, D-110, PC-200",
    "members": "Wallin, Ö-dahl (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1989-1990",
    "unreleased": true
  },
  {
    "img": "03-Cassette",
    "name": "Buddhas Besättning - The maniac puppet performance (live)",
    "tracklist": "Intro (live), Agony and fake reactions (live), The test (live), Corruption (live), Body-Mechanic (live), Henry Spencer and the garden of evil (live), Prohibited (live), Erleben nicht aus (live), Horst (live)",
    "equipment": "Denon DRM-800, Korg KMX8, Yamaha DX21, Electone radio/tape recorder, Ibanez guitars",
    "members": "Wallin, Ö-dahl, A, Tisa (Joacim Thenander, Jonas Österdahl, Henrik Araviadis, Mattias Axén)",
    "recorded": "January 13, 1990",
    "unreleased": true
  },
  {
    "img": "02-Cassette",
    "name": "Herr Capitan - This side of the terror",
    "tracklist": "Intro, Impulzus, The test, Brutalize, Body-Mechanic, Henry Spencer and the garden of evil, Erleben nicht aus, Outro",
    "equipment": "Atari 1040STFM, Steinberg Cubase 1.0, Yamaha TX81Z, Korg KMX8, Roland S-330, D-110, PC-200",
    "members": "Igor Van Der Heyden, Marc Voorhees, Keith Joyce, KOEN (Joacim Thenander, Jonas Österdahl)",
    "recorded": "1990",
    "unreleased": false
  },
  {
    "img": "01-Cassette",
    "name": "Cultivated Bimbo - Remixed, decorated and reconstructed",
    "tracklist": "Impulzus (P.E. edit), Slaughter house (P.E. edit), Brutalize (P.E. edit), Walking on acid (P.E. edit), Pain (P.E. edit), Corruption (P.E. edit), Horst (P.E. edit), Brain diggers (P.E. edit), Assassin (P.E. edit), Take no. 5 (P.E. edit), Fascisma (P.E. edit), Mr Rubber (2020 v2 no-co remix), Dr Penetration (P.E. edit), Down down down (decorated 2020)",
    "equipment": "Ableton Live, Roland MX-1, System-1m, TR-08, TR-09, SH-01a, SE-02, Behringer Neutron, Pro-1, Model-D plus instruments on original recordings",
    "members": "Joacim Thenander, Jonas Österdahl",
    "recorded": "2020",
    "unreleased": false
  }
]
