[
  {
    "paragraph": "Early 1985, in a small village outside Uppsala, Sweden, the two young boys Joacim and Jonas start making music using an old Tandberg Reel-to-reel and a cheap keyboard. Their parents seems to like their new interest and start helping them financially with equipment for their “studio”. Just a few months later the first tracks are made and recorded. They decide on taking the name Buddhas Besättning, suggested by a good friend of Jonas - Henrik Araviadis. Henrik will be very involved with the band later on, especially on Cultivated Bimbo’s last album “Album. 1995.”, as the third member. They record loads of tracks using the Buddhas Besättning moniker and the songs are collected on several cassettes."
  },
  {
    "paragraph": "Buddhas Besättning played live a number of times. The last concert was in Västerås, January, 1990, where they performed ”Body-Mechanic” and ”The Test” among others. The tracks were then re-recorded and featured on a demo cassette that was given to Krister Svensson (Electronic Beat Association) in May 1990. By then the band had changed their name to Herr Capitan. The demo led to the band being signed just a few weeks later."
  },
  {
    "paragraph": "The music did evolve quite a bit during the five years leading up to Cultivated Bimbo. In 1987 the band went from the ”digital synth pop” genre to much harder music. Heavily influenced by bands such as Nitzer Ebb, Front 242 and à;GRUMH... they started exploring the Electronic Body Music scene. The demo ”Pest” features quite a few EBM tracks and already the year after they had refined the genre and recorded the cassette ”Die Die Mauer Bau”. This also became their new name. From this release they grabbed a track as Cultivated Bimbo's debut. ”Corruption” was made in 1988, and re-recorded 1990, 1991 and eventually 1993 as ”The Final Attempt” on ”Blasting In Progress”. This is the reason that the bonus track on ”Tunes from a high wire” is called ”Corruption (Mix 3)”. Funnily enough the working name of the Die Die Mauer Bau project was ”Blasting In Progress”."
  }
]
