[
  {
    "paragraph": "The two following years (1988-1989) were incredibly busy. Joacim had to quit the rock band he was playing with since 1982 to have time for all the other projects. In 1988 he was picked up by the industrial synthetic band Angsttraum and toured around Sweden. The year after the band changed their name to Systema The Affliction and released an album on Strontium Records. Most of the tracks were written and co-written by Joacim. Alongside Angsttraum, Joacim continued with the musical journey he and Jonas started in 1985. And now Joacim and Jonas were planning on go on stage. New tracks were made for this specific occasion and two extra musicians were involved: Henrik Araviadis and Mattias ”Tisa” Axén. Later on Tisa played trombone and sung on ”Tunes from a high wire” and also did a track together with Joacim on the compilation ”To cut a long story short” (as Wallin & Tisa). The name of this live project was originated from a friend of Jonas and Joacim - Jon Hällgren. He later played slap bass on the track ”Blast Off” from Cultivated Bimbo's last album. The project, named Lesbian Disguise of a Female Body, went on stage on February 19, 1988. Joacim on drum machines and computers, Jonas on radio and samples, Tisa on synthesizers and Henrik on guitars. The full concert is included on ”Prequel Extended”. This was the first time they performed ”Erleben Nicht Aus”, which later was included on Culivated Bimbo's debut album."
  },
  {
    "paragraph": "In 1989 the live crew got together once again, but this time without Tisa, but with an extra guitarist - Örjan Gudmundsson. New tracks and a new name - The Female Body. The musical direction changed once again. The greatast influences at the time were Adrian Sherwood and his Tackhead Sound System. This year the acid rave scene absolutely exploded. This was reflected on the demo cassette ”Dead Aim & Attack”, now using the moniker Slam Jam Dynamite. Joacim was called Mr Kornfield and Jonas called himself Terminator Sam. The direction was acid, hip house and dance music in general. The name of the cassette was re-used for a track on ”Tunes from a high wire”. Slam Jam Dynamite were also credited as remixers of ”Ice Blender (Stakked Version)” on ”Blasting In Progress”. Use, reuse and recycle."
  },
  {
    "paragraph": "Joacim and Jonas did a last live gig under the name Buddhas Besättning in early 1990. The tracks were a collection of new and some older tracks. For the third time they brought Henrik to the stage with his guitar. One of the new tracks were very well received. The track was called ”Body-Mechanic” and one of the members of Systema The Affliction - Wiktor Wong - suggested a change in the chorus after he heard it. Back in the studio they made the changes and wrote some real lyrics (instead of the fake ones they used on stage). They then included the track on the new cassette ”This side of the terror”. This time the name of the band was Herr Capitan. The cassette also included a new version of ”Erleben Nicht Aus”. All tracks on this cassette except for ”Impulzus” were later included on different Cultivated Bimbo releases. ”Henry Spencer and the garden of evil” was renamed to ”Qui est quoi?”, and one of the tracks - ”Brutalize” - was re-sculpted and renamed to ”In Brief” when released on ”Tunes from a high wire”."
  }
]
