[
  {
    "name": "PHAZE V",
    "info": "Early in 1985 Jonas and Joacim recorded two tracks on the reel-to-reel, using a Roland SH-101 and a JVC KB-600. They used the sequencer on the SH-101 and played the KB-600 in real time. Loads of overdubs which resulted in a very noisy recording. The first track was called ”Orientalisk böldpest”. They included the track on several demos, and played it live in front of an audience the year after. During the early summer in 1985 the two went to Keyboard City in central Stockholm to buy a drum machine. They ended up buying a polyphonic synthesizer as well, because they needed a replacement for the borrowed SH-101. For just under SEK 10.000:- they returned with a Yamaha DX21 synthesizer and RX21 drum machine. At the time this was state-of-the-art. On a budget. \n Back in Uppsala they recorded two more tracks and called the recorded songs ”Phaze V”. But the name would just last a short while."
  },
  {
    "name": "BUDDHAS BESÄTTNING",
    "info": "A friend of Jonas - Henrik Araviadis - came up with a brilliant name. One could simply say that Buddhas Besättning is the core of the band. All names and aliases are different versions of Buddhas Besättning. It’s even mentioned in almost all demos and releases of every alias. For instance the cassettes with The Female Body and Lesbian Disguise of a Female Body displays ”A project by Buddhas Besättning” on the cover. On the Cultivated Bimbo debut ”Configuration 1” Buddhas Besättning is credited as mixing engineers.\nThe music made under this umbrella varies from instrumental synth pop to to more aggressive industrial music. The last concert made (January 1990) included early versions of ”Body-Mechanic”, ”The Test”, ”Erleben Night Aus”, ”Corruption” and Qui Est Quoi?”, so by then the band had slowly turned into what would become Cultivated Bimbo a few months later. On stage Joacim and Jonas was accompanied by Mattias ’Tisa’ Axén and Henrik Araviadis who later on were quite involved in Cultivated Bimbo."
  },
  {
    "name": "LESBIAN DISGUISE OF A FEMALE BODY",
    "info": "In 1987 Buddhas Besättning was asked to play live at a venue in Uppsala, Sweden. Both Joacim and Jonas were a little bit afraid to go on stage, so they asked their fellow friends Tisa and Araviadis to join. The evening was recorded and because of the line-up the four members agreed to use another name. A name that a guy named Jon Hällgren came up with. Jon is the bass player on ”Blast Off” (The Album. 1995.). The name was Lesbian Disguise of a Female Body.\nThe music was very rhythm oriented and a radio and cassette player were used as an instrument by Jonas. Araviadis played guitars, Tisa handled the MS20 and Syncussion Percussion synthesizer while Joacim took care of the sequencers, drum machines and vocals. This was a one-time gig, but three of the four bandsmen would join together soon again, but under a slightly different name - The Female Body."
  },
  {
    "name": "THE FEMALE BODY",
    "info": "Same line-up as the Lesbian Disguise of a Female Body gig with one exception; Tisa weren’t able to join, so the guitarist Örjan Gudmundsson were asked to double Araviadis’ guitars. The concert was held in September 1989 and the music differed from the earlier live gig. This time the guitars had an emphasised role and the music leaned more towards heavy rock. The songs were recorded in the studio as well, but without the extra guitars.\nThe track ”Mania (Ecvation)” were later used as the foundation to the track ”Sleeping Beauty ’91” on Cultivated Bimbo’s debut album ”Tunes from a high wire”."
  },
  {
    "name": "SPRECHEN EUDO KRANZ",
    "info": "Some of the tracks Joacim and Jonas made 1988-1989 didn’t fit the current projects. Four of the tracks were planned to be released under the moniker Sprechen Eudo Kranz. The name of the demo was ”Kino”, but it was never released. There were always other music lurking around the corner that drew their attention. Fortunately, the demo still remains."
  },
  {
    "name": "DIE DIE MAUER BAU",
    "info": "In 1988 the band started experimenting with distortion for the first time. Joacim listened a lot to industrial EBM bands at the time, and this was reflected in the music. The Die Die Mauer Bau demo was very playful and and easy to make. They really enjoyed the time in the studio recording these powerful hard-hitting tracks with driving bass lines. During this period they wrote ”Corruption” - maybe the best Cultivated Bimbo track to date.\nMusically, Joacim and Jonas were planning on much more than the body scene that Die Die Mauer Bau strived for. That would do for another name change."
  },
  {
    "name": "SLAM JAM DYNAMITE",
    "info": "Techno, acid, house, hip-hop, hip-house, rave - the name of the dance genres were endless. But here is where Joacim and Jonas were to stop this time. They used loads of samples from famous dance tracks, and mashed up beats and breaks to be something new, yet like something you would love to dance to. They introduced rap in their music, and decided on the most powerful name they could think of. The studio was called Boom Boom Recordings, the production company (fictitious, of course) was called Bang! Productions. So what could be a better name than Slam Jam Dynamite? The demo followed the same path and was called ”Dead aim & attack”. They changed their own names to be able to use them in their raps. Joacim became Mr Kornfield and Jonas became Terminator Sam. \n In parallel with ”Dead aim & attack” they worked on a demo called ”Time”. A couple of the tracks were included on the ”Dead aim...” cassette, but the most part were being forgotten in this busy time. These tracks, among with even more unreleased Slam Jam Dynamite tracks is now included in this collection. And the name? ”Time” of course."
  },
  {
    "name": "HERR CAPITAN",
    "info": "In 1988 Joacim started playing with the band Angsttraum (later Systema The Affliction) and what he did with them started to be reflected in the music he made with Jonas. After the demos with Slam Jam Dynamite and The Female Body, they were ready to upgrade their sound and studio. With new equipment they started working on new tracks and also did a live gig in Västerås in January 1990, supporting Joacim’s other band Angsttraum. This time they re-used the Buddhas Besättning moniker. They brought together the Lesbian Disguise of a Female Body line-up, and played a bunch of new tracks. These tracks were polished and released on the cassette ”This side of the terror”. For the seventh (but not last) time they took a new name - Herr Capitan.\nThe cassette was released in April 1990, and less than two months later  - after giving the demo to Krister Svensson (Electronic Beat Association) - they were signed and got their first record contract."
  },
  {
    "name": "CULTIVATED BIMBO",
    "info": "Joacim and Jonas were never really satisfied with the Herr Capitan-name, so when it was time to release the debut single on Electronic Beat Association they took the name Cultivated Bimbo. The story about where the name come from varies, and more than one version does exist. The band themselves told several made-up stories, but the truth is this: In 1987 the label Front Music Production released a compilation cassette featuring a bunch of small Swedish industrial electronic bands. One of those were Sound Manufacturers. Joacim absolutely loved their songs - especially one called ”Cultivated beauty”. Joacim talked to a good friend of his - Michael Janvid - about taking the name for his band. Michael, who was studying philosophy, suggested that they should replace ”beauty” for ”bimbo”. That would be paradoxical and much more interesting.\nLate in the autumn the band - now Cultivated Bimbo - released ”Configuration 1 on Electronic Beat Association. This would be their only release on the label. A few weeks later the label would be merged with two other labels - Energy and Front Music Production - and Energy Rekords was born. The story with Cultivated Bimbo continues.\nBut that is another chapter."
  }
]
